<a href="https://colab.research.google.com/github/ogbcode/chidubem-ogbuefi-CSC102/blob/main/chidubem_ogbuefi_claassswork.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
names =["ann","jane","joan","clare","elizabeth","charles","jude","james","kelvin","prosper"]
age =[14,16,14,17,16,15,16,16,17,14]
height =[5.5,6,5.4,5.9,5.6,5.7,5.9,5

## step 2: create a dictionary object containing the observations

In [ ]:
tab={"names":names,"äge":age,"height":height,"scores":scores}

In [ ]:
import pandas

In [ ]:
data=pandas.DataFrame(tab)

In [ ]:
data

       names  äge  height  scores
0        ann   14     5.5      80
1       jane   16     6.0      85
2       joan   14     5.4      70
3      clare   17     5.9      60
4  elizabeth   16     5.6      76
5    charles   15     5.7      85
6       jude   16     5.9      74
7      james   16     5.8      87
8     kelvin   17     6.1      75
9    prosper   14     5.9      68

In [ ]:
data.to_excel("data.xlsx")

In [ ]:
import pandas
r_d_spend =[1234,2356,78,7655,7754,7755,7554,996,455,4234]
administration =[143,167,1894,1907,106,1675,1776,1446,1557,1784]
marketing_spend =[5895,996,994,599,596,589,569,534,567,789]
state=["new york","california","florida","new york","florida","newyork","california","florida","new york","california"]
profit=[1443,456,7544,6674,644,345,645,545,657,666]
tab={"R&D spend":r_d_spend,"administration":administration,"marketing spend ":marketing_spend ,"state":state,"profit":profit}
data=pandas.DataFrame(tab)
data
index=False
data.to_excel("chidubem ogbuefi problem solving.xlsx")
pandas.read_excel("chidubem ogbuefi problem solving.xlsx")

   Unnamed: 0  R&D spend  administration  marketing spend        state  profit
0           0       1234             143              5895    new york    1443
1           1       2356             167               996  california     456
2           2         78            1894               994     florida    7544
3           3       7655            1907               599    new york    6674
4           4       7754             106               596     florida     644
5           5       7755            1675               589     newyork     345
6           6       7554            1776               569  california     645
7           7        996            1446               534     florida     545
8           8        455            1557               567    new york     657
9           9       4234            1784               789  california     666

In [ ]:
distance=float(input("how far does the car go in miles"))
time=int(input("what is the time taken to reach that distance in hours"))
speed= distance/time
print("the car goes",speed,"miles/hour")

how far does the car go in miles50
what is the time taken to reach that distance2
the car goes 25.0 m/s

In [5]:
print("ax^2+bx+c=0")
A=float(input("what is the value of a:"))
B=float(input("what is the value of b:")) 
C=float(input("what is the value of c:"))
x1=(-B+((B**(2)-(4*A*C))**(1/2)))/(2*A)
x2=(-B-((B**(2)-(4*A*C))**(1/2)))/(2*A)
print("the roots of the quadratic equation are ",x1,"and",x2)

ax^2+bx+c=0
what is the value of a:2
what is the value of b:3
what is the value of c:

ValueError: ignored

In [18]:
print("Player 1 pick yor side odd or even")
player1side=input("player 1 pick your side")
if player1side =="odd": 
     print("player 2 your side is even")
if player1side =="even":
     print("player 2 your side is odd")
p1=int(input("player 1 pick your number"))
p2=int(input("player 2 pick your number"))
ptotal=p1+p2 
if ptotal%2==0:
  print("even side wins the game")
else:
  print("odd side wins the game")

Player 1 pick yor side odd or even
player 1 pick your sideeven
player 2 your side is odd
player 1 pick your number2
player 2 pick your number3
odd wins the game